Repository: oliverklee/ext-csv_to_openimmo
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# schedulerTask.title
source: CSV-to-OpenImmo converter
de: CSV-nach-OpenImmo-Konverter

# schedulerTask.description
source: This task reads zipped CSV files with realty data from one directory and creates zipped OpenImmo files from them in another directory.
de: Dieser Task liest gezippte CSV-Immobiliendateien aus einem Verzeichnis und erzeugt daraus gezippte OpenImmo-Dateien in einem anderen Verzeichnis.

# schedulerTask.configuration.sourceFolder
source: Source directory with the zipped CSV files (absolute path)
de: Quellverzeichnis mit den gezippten CSV-Dateien (absoluter Pfad)

# schedulerTask.configuration.targetFolder
source: Target directory for the created zipped OpenImmo files (absolute path)
de: Zielverzeichnis für die gezippten OpenImmo-Dateien (absoluter Pfad)

# schedulerTask.configuration.deleteProcessedSourceFiles
source: Delete source files after they have been processed
de: Quelldateien nach dem Verarbeiten löschen

# schedulerTask.configuration.errors.sourceFolder.empty
source: Please enter a source directory.
de: Bitte tragen Sie ein Quellverzeichnis ein.

# schedulerTask.configuration.errors.sourceFolder.nonexistent
source: Please enter an existing source directory.
de: Bitte tragen Sie ein existierendes Quellverzeichnis ein.

# schedulerTask.configuration.errors.sourceFolder.relative
source: Please enter an absolute path for the source directory, not a relative one.
de: Bitte geben Sie den absoluten Pfad des Quellverzeichnisses an, keinen relativen.

# schedulerTask.configuration.errors.sourceFolder.noDirectory
source: Please enter a directory as the source directory, not a file.
de: Bitte tragen Sie als Quellverzeichnis ein Verzeichnis ein, keine Datei.

# schedulerTask.configuration.errors.sourceFolder.notWritable
source: Please enter a writable directory as the source.
de: Bitte geben Sie ein beschreibbares Verzeichnis als Quelle an.

# schedulerTask.configuration.errors.targetFolder.empty
source: Please enter a target directory.
de: Bitte tragen Sie ein Zielverzeichnis ein.

# schedulerTask.configuration.errors.targetFolder.nonexistent
source: Please enter an existing target directory.
de: Bitte tragen Sie ein existierendes Zielverzeichnis ein.

# schedulerTask.configuration.errors.targetFolder.relative
source: Please enter an absolute path for the target directory, not a relative one.
de: Bitte geben Sie den absoluten Pfad des Zielverzeichnisses an, keinen relativen.

# schedulerTask.configuration.errors.targetFolder.noDirectory
source: Please enter a directory as the target directory, not a file.
de: Bitte tragen Sie als Zielverzeichnis ein Verzeichnis ein, keine Datei.

# schedulerTask.configuration.errors.targetFolder.notWritable
source: Please enter a writable directory as the target.
de: Bitte geben Sie ein beschreibbares Verzeichnis als Ziel an.

# schedulerTask.configuration.errors.folders.identical
source: Please use different directories for the source and target.
de: Bitte geben Sie unterschiedliche Verzeichnisse als Quelle und Ziel an.
